{
  "Teacher Resumes": "Being a teacher in Australia is a highly rewarding career choice as there is always a high demand for high quality, well qualified teaching professionals around the country. However, to achieve a permanent education or relief teaching role it is also a highly competitive industry for both new education graduates and experienced teachers applying for employment. At Exceptional Study Australia we offer a team of existing and experienced teachers and recruiters who specialise in writing education industry based resumes and employment applications. Our resumes are targeted at supporting teachers, trainers, educators and tutors within the education industry. Although many jobseekers may hold a certificate, diploma, advanced diploma, bachelor’s degree, master’s degree or PHD in an education related field it is vital that our jobseekers are effectively promoted in a detailed, honest and well-written manner in order to capture their love of education, their skills, their educational background, their experience history and every other important attribute they bring to the education industry.",

  "About our Director": "Exceptional Tuition and Resumes was proudly founded by award winning Gold Coast entrepreneur, academic, HR professional and careers speaker, Monique Jeremiah in 2010. As a relationship and results driven professional with an undeniable passion for education and employment, Monique started the company in order to help university students and jobseekers to achieve a competitive advantage in the employment market. Coming from a family of nurses and well-educated professionals, she recognised the need to develop a resume writing service dedicated to helping nurses, university and RTO graduates and construction workers to promote themselves effectively and achieve a well written employment application. With a community driven spirit, Monique also highly values the skills of nurses and construction workers and what they bring to society. Equipped with a Bachelor of Business (majoring in human resources and industrial relations), a",
  "About our Resume Writing Services": "As a specialist employment agency Exceptional Study Australia can help you in creating new resumes, updating existing resumes, writing professional cover letters, creating responses to selection criteria, writing suitability statements or developing an effective LinkedIn profile to help you promote yourself to prospective employers. Overall it is our ambition to help nurses and construction workers to achieve interviews through working with our clients individually, understanding their personal needs,",
  "About our Resume Writing Process": "Step 1 : Choose the Individual Service or Package you require Step 2 : Send us an email including the following details: Your selection, a copy of your old resume (if applicable) and a copy of your job description and selection criteria (if applying for an advertised position) Your contact details, including your full name, address, email address and mobile and home number.",
  "FAQ / LINKS": "About resume writing ​What employers look for in a resume? Your resume is an essential promotional tool to help you apply for any graduate program, agency role, full-time job or other work project. Therefore it should always be honest, well detailed and capture you as a jobseeker in the most positive light. Font should be reasonably sized, easy to read, and have a normal size margin. Words should be highly targeted and specific to your profession. Only relevant information should also be included in your resume. Employers also appreciate an aesthetically appealing resume without all the gimmicks. A direct, straight to the point resume achieves best results always.​  What are the benefits of a professionally written resume? ​ An effective resume will:  Help you to stand out from the other applicants, increasing your chances of achieving your dream job Will be read from start to finish if kept to an appropriate length and formatting is easy on the eye Will give you a competitive advantage in the job market Will ensure that employers can see your potential and recognise your talent or ability to be trained in new and existing areas Will outlines your key characteristics and skills which will be valued and relevant to specific employers ​ Why choose Exceptional Tuition and Resumes? ​ We tailor make our resumes and other employment documents to present you to be the perfect candidate for your desired position By having connections with many professional partners, we can ensure the language used matches the industry you wish to work in We provide a professional resume that stands out and looks visually appealing to catch the recruiters eye quickly Our jobseekers are our priority and we are happy when you are happy We are able to meet deadlines to ensure you are able to apply for jobs on time What is LinkedIn? ​ LinkedIn is a social networking website for people in professional occupations It is the largest professional networking site with millions of members You are able to create a professional profile, which is your online resume This site enables you to build networks with a range of professionals Provides to opportunity to learn about your industry and able to learn about various career options How can you use LinkedIn to Find a Job? By connecting with many professionals, this site gives you opportunity to contact them about prospective jobs You are able to join groups in regards to specific companies giving you the opportunity to be one of the first to know about vacant jobs There is also a job tab on LinkedIn where you can write a specific job you are looking for It is also helpful to find out who to address cover letters to by typing in the company and finding their recruiter or the Human Resources Manager and provide a means of contacting them before submitting your job application ​ What can you include in a LinkedIn profile? ​ Provide a background or summary of your work history and what job or industry you are looking to work in Past education and even the subjects or classes you completed during your studies Places your past work history in chronological order, an online resume Shows a company profile so if recruiters want to witness the company and your past engagement with it Able to displayed your interests, which provides an insight on how you enjoy your free time You can write what you believe your key skills are and others can endorse you for them Can also include up to 50 groups that you can be apart of whether this is company group or industry advice groups ​ How can jobseekers benefit from having a LinkedIn profile? ​ Jobseekers have the opportunity to connect with professionals worldwide ultimately broadening their options for acquiring their dream job By joining various groups this allows jobseekers to connect and contact people to gain advice about their desired job or industry As LinkedIn is an online resume, this provides employers the option to find you making your job seeking adventure less stressful Broaden their awareness of companies which are recruiting Make contacts with potential recruiters Ability to find online advertised job through the job tab on LinkedIn Gives opportunity to connect with people who are of influence in a certain company",
  "Contact us": "Thank you very much for your interest in Exceptional Study Australia. If you would like to organise any resume writing with us or would like any more information about what we do, please feel free to contact us via any of following methods: Phone / Text: 0447 840 939 Email: exceptionalstudyaustralia@gmail.com Office Hours: Monday – Friday 9am – 6pm / Saturday 9am - 3pm ​ Connect With Us on Social Media ​ Facebook: https://www.facebook.com/exceptionalstudyaustralia/  Twitter: https://twitter.com/ExceptionalAust  Instagram: https://www.instagram.com/exceptional_study_australia/?hl=en  LinkedIn: https://au.linkedin.com/company/exceptional-study-australia  Youtube: https://www.youtube.com/channel/UCa1502fgXTAEJ_ah4wa64Dw",

  "Resume Services for International Nurses": "PROFESSIONAL RESUMES AND COVER LETTERS FOR NURSES At Exceptional Study Australia, we pride ourselves on being expert in assisting international nurses or international students who are studying to be nurses in Australia to write professional nursing resumes and cover letters for a variety of positions in the healthcare industry.  Current Australian Nursing Graduate Programs  Please LIKE Exceptional Study Australia on Facebook or FOLLOW Exceptional Study Australia on LinkedIn for current nursing graduate program details and nursing job opportunities across Australia.  AHPRA (Australia Health Practitioner Regulation Agency) https://www.ahpra.gov.au/  The Australian Health Practitioner Regulation Agency is the national organisation responsible for implementing the National Registration and Accreditation Scheme across Australia, in partnership with the 15 National Boards. Guided by a nationally consistent law, AHPRA and the National Boards work to regulate the health professions in the public interest. This includes registering practitioners who are suitably trained and qualified to provide safe healthcare and investigating concerns about registered health practitioners.  SELECTION CRITERIA AND SUITABILITY STATEMENTS FOR NURSES  At Exceptional Study Australia, we specialise in writing answers for selection criteria for both graduate nurses and experienced nurses.  Why is Selection Criteria Important for Jobseekers?  When answered well, the selection criteria can help employees to:  Demonstrate capability by providing evidence of how you meet the selection criteria Demonstrate competency to deal with certain situations How Can Selection Criteria Help Employers?  It can assist employers by:  Indicating relevant knowledge and skills of their applicants Providing past examples of behaviour and outcomes in certain situations Assessing suitability of candidates How Can You Use Selection Criteria to Sell Yourself as a Jobseeker?  You can use the selection criteria to sell yourself as a jobseeker by:  Setting yourself apart from other candidates Highlighting important knowledge and skills necessary Demonstrating abilities to handle yourself in a variety of nursing situations Providing honest, well thought out and organised responses to clearly communicate that you meet the essential criteria (and desirable criteria). LINKEDIN PROFILES FOR NURSES  At Exceptional Study Australia we can develop your professional LinkedIn profile as a nurse. As the world’s most comprehensive professional network, LinkedIn features more than 200 million members from around the globe comprising of jobseekers, recruiters and businesses in all different industries, including the healthcare industry. As a nurse creating a LinkedIn profile may be a strategic and positive career investment to distinguish you and set you apart from other graduate nurses and experienced nurses in Australia and internationally. To a professional candidate, a properly decorated and written LinkedIn profile can help you create your brand and effectively position yourself for a professional position in the nursing industry. LinkedIn allows you to promote yourself as a nurse online, actively connect with a wide range of professionals, put you in front hundred od healthcare recruiters, hiring managers, nursing agencies and Human Resource executives and allows you to stay in contact with current and former colleagues, employers and other contacts if they are also on LinkedIn. For a nurse, LinkedIn is a hidden gold mine for healthcare employment opportunities and networking.  Exceptional Study Australia provides a professional team to complete LinkedIn profile writing services. We provide a keyword-optimized profile service. Our goal is to develop a comprehensive profile for our jobseekers, achieve a higher ranking on the LinkedIn platform, differentiate our clients from our competitors, and increase our jobseekers’ overall visibility to recruiters and potential employers online.",
  "Become an assistant in nursing (AIN) in Australia": "What is an Assistant in Nursing in Australia? Assistants in Nursing (aka Nursing support workers or AIN) is a job which is lead by registered nurses to deliver limited care to patients. This job needs workers to have strong communication ability, empathy and customer service skills of helping with patient’s daily routines. These routines may be showing, toileting, dressing, eating, mobility and exercise regimes. Being an AIN also requires workers to keep patients’ records for doctors and assist in planning of daily routines for patients. Tasks and duties Assisting patients with their daily personal care needs such as showering, toileting, shaving, oral hygiene, dressing and eating Assisting patients with their mobility and communication needs Following therapy plans such as interventions to assist those with dementia and behavioural problems Observing and reporting changes in patients' condition Assisting with rehabilitation exercises, basic treatment and delivering medications Assisting nursing and midwifery staff with routine technical support functions including setting up for procedures, cleaning equipment and completing basic documentation Maintaining accurate and detailed patient records Building effective relationships with patients through clear communication and empathy Applying simple wound dressings Job Requirements  To become an assistant in nursing you need to compete a qualification in Health Assistance. The minimum qualification level is Certificate III in Health Assistance and that also includes completion of work placement hours consisting of around 120 hours. An assistant in nursing does not need to have completed a Bachelor degree but students who are completing or have already completed a Diploma of Nursing or Bachelor of Nursing can apply for an AIN role.  How to apply for an AIN job  Being an AIN is a fundamental healthcare job in Australia. You can be an AIN in all states in Australia and is highly influenced by a jobseekers’ communication and care abilities because you are not only required to communicate with patients but also communicate with their families and professional doctors. You should also have a strong ability of tolerating unhygienic situations and mess because you will spend a lot of time dealing with patients’ waste and vomitus. Becoming an AIN is often a starting point for many nurse’s careers. It is a great entry point to becoming a future enrolled nurse or registered nurse in future.  Study to become an assistant in nursing in Australia as an international student  Many international students become an AIN as part of their nursing career as it a fairly easy entry level nursing job to apply and enter into if English is your second language. You will commonly be employed in aged care facilities and nursing homes and will work with more senior nurses. It is expected that you will complete a Certificate III in Health Assistance as a minimum prior to becoming an AIN.  Challenges  It is significant that many AIN will be required to work overtime and late nights. In some situations, you may also have to work on weekends and holidays. It is an expectation that you may need to adjust to this kind of shift work to prevent yourself from burn out and exhaustion. As you will be often dealing with the elderly you may be dealing with residents / clients who are in bad moods, carrying negative thinking, poor memory and geriatric behaviour. They may also be patients who may be suffering from huge pain and loss. Therefore it is important to be compassionate, understanding and treat all with kindness and care. Additionally being an international students you may face a culture gap between Australia and your home country during your work.  Salary  The most common annual salary in Australia for an assistant in nursing is between 45k AUD and 55k AUD. Most hospitals and aged care facilities offer around 50k AUD for AIN as annual salary. The more experience you have, the higher salary will be.",
  "Become a registered nurse (RN) in Australia": "What is Registered Nurse in Australia? In Australia Registered nurses are in charge of primary health care in hospitals, aged care, community institutions and school settings. It is a job with a high level of expertise, responsibility and respect within the healthcare environment. Registered nurses are usually a character of a unit manager or team leader in a health care service team. Enrolled nurses and assistants in nursing often report to registered nurses when they are in training or are in need of supervision or support within their nursing role. Duties Observation and recording patients’ health care conditions and physical situations Giving medication to patients and providing them medical equipment relating with their health care outcomes Preparing patients for examinations Assisting in operations and providing post-operative preparations Special situation  Registered nurse are also in charge of communities and community events. They are usually responsible for health promotion, chronic disease management and prevention illness by providing care. They are always the best counsellors for health care in a community. This means that many RN face heavy workloads and are required to work with a high level of responsibility and diligence to meet patient needs.  Also, RNs may play different roles depending on what patients they will see and the setting of their works. Often they work with allied healthcare professionals and other clinical professionals such as doctors, surgeons, physiotherapists, specialty nurses and others to provide efficient healthcare to patients.  Job requirements  In Australia registered nurses need to have completed a Bachelor of Nursing and apply to AHPRA (Australian Health Practitioners Regulation Agency) to practice as a registered nurse. They also need to renew their registration annually to keep their qualification. The also need to work for a couple of years in a general capacity as a registered Nurse. During this experience, it is also important for nurses to decide which areas they wish to specialise in. Nurses may elect to work in any of the following clinical areas: burns, cardiology, cosmetic nursing, community, dialysis, education, emergency, family health, aged care, infection control, intensive care, management, medical nursing, mental health, neonatal intensive care, oncology, paediatrics, peri-operative, plastic surgery, rehabilitation, remote area nursing, research, rural nursing, school nursing, surgical nursing or wound management.  Student Visa Requirements  For international nurses you will also need to ensure you secure a student visa if you intend to study nursing in Australia. Therefore you will need to gain the following:  a valid passport for the duration of your study in Australia offer letter from the selected university/institution IELTS score 7 overall and no score below 6.5 in each of the component; or PTE score 65 or OET score B At least 1 year of paid or unpaid experience within the last five (5) years. * evidence of access to sufficient funds* evidence of Overseas Student Health Cover successfully completed at least year 12 AQF or Australian Qualifications Framework equivalent* all other relevant documents listed on the Department of Home Affairs visa checklists How to apply for Registered Nurse  You will firstly need to complete a Bachelor of Nursing for 3 years in Australia on a full-time capacity. Some schools and universities can provide fast-tracking which make you be able to complete the degree in 2 years, including clinical placements. Basically, you will study on campus, face to face, with some elements delivered online to pass all of your courses. Often there will be 840 hours of clinical experience via professional placements during your study in a range of health care settings.  If you cannot achieve the Bachelor degree initially, it is worthwhile considering completing a Diploma of Nursing as a pathway, prerequisite/ prior qualification prior to entering the Bachelor of Nursing. Commonly a Diploma of Nursing can be completed on a full-time basis and completed over 20 months. Diplomas are completed face to face on campus and contains 400 hours of unpaid clinical placement in a range of professional workplace settings in order to help students boost their practical skills. After achieving a Diploma of Nursing, students can become and apply to be an Enrolled Nurse first. This can then be a pathway to further nursing studies into a Bachelor of Nursing and progression to become a fully fledged registered nurse. The most important step for any registered nurse will of course be registering with the AHPRA (Australian Health Practitioners Regulation Agency) and meet the NMBA (Nursing and Midwifery Board of Australia)’s registration standard to work in Australia as a Registered Nurse.  For more details of requirements please visit this link:  www.nursingmidwiferyboard.gov.au/Registration-Standards.aspx Study to become a Registered Nurse in Australia as an international student  It is not secret that international students will face a lot of challenges and difficulty when they are trying to become a registered nurse in Australia. Beside the linguistic requirements of completing their IELTS test and meeting the minimal IELTS score, registered nurse also need to remember and use plenty of professional medical and clinical terminology during their work time. Also, they may experience different medical environments and requirements in Australia from their home countries. Therefore they need to adjust to these kinds of differences during their studying process of their Bachelor degrees.  Challenges  The work of a registered nurse can be quite different and mixed which depends on what kind of patients they are dealing with. Registered nurses often engage in shift work and are expected to work long periods of time. They may also need to work night shift or weekend work which can present social challenges if balancing work and family life. Sometimes more ambitious registered nurses may become a nursing leader, therefore with leadership comes a huge pressure and responsibility to make decisions relating with patients’ lives. Also, they may have to decide which field they wish to work in further while they are working. Therefore as professional development is an important element of the career of a registered nurse it can be expected that registered nurses will need to undertake ongoing study, short courses and inhouse education training to further their skills. Therefore an openness to learning would be expected. Additionally all registered nurses can expect to be challenged with various patients, team members and high pressure circumstances, therefore all actions should be taken with a high ethical and moral standard at all times. Patients and their welfare must always be made a priority and emotions sometimes need to be left at the door as a registered nurse.  Salary  The most common annual salary in Australia for registered nurses is generally between 65k AUD to 75k AUD. However if you train and specialize in other clinical fields, you can expect the salary to be higher in some employers and depending if you work in private or public healthcare organisations.",
  "Become an enrolled nurse (EN) in Australia": "What is an Enrolled Nurse? An enrolled nurse works under the direction and supervision of a registered nurse in order to provide health care to patients in any clinical setting. Enrolled nurses provide physical and emotional care to more complex duties such as giving medications. Enrolled nurse will often have a chance to work in different clinical specialities including medical, surgical, mental health, paediatrics, orthopaedics, rehabilitation, oncology, operating theatres, rural and remote, emergency and community health care settings. Also, they may be found in aged care settings. Duties Observing and recording patients’ vital statistics and reporting the changes in patients’ conditions and the data to Registered Nurses or doctors who are in charge Providing physical and emotional support to patients and their families Assisting with activities of daily living such as personal hygiene, bathing, dressing and feeding Special situation Enrolled nurses act as a helper and co-worker for registered nurses. They may directly or indirectly be supervised by registered nurses depending on their nature of the work and the clinical environment they are assigned. Enrolled nurses can also provide support to patients in aged care, welfare, communities and community events. Job requirements The minimum level of study required for an enrolled nurse in Australia is a Diploma of Nursing. It is currently open for people in society (not current students) who keep Certification III with relevant industry experience or a Certification IV or higher, too. Applicants should apply to the NMBA (Nursing and Midwifery Board of Australia) to work as an enrolled nurse in Australia. This certification should be renewed annually. How to apply for an enrolled nurse as an international student Students should complete the Diploma of Nursing first. A Diploma of Nursing is completed on a full-time basis and can be completed in 20 months. The courses are also completed face to face on campus and contain 400 hours of unpaid clinical placement in a range of professional workplace settings. After achieving a Diploma of Nursing, appliers can apply to become an Enrolled Nurse. This program is not based on the ATAR (Australian Tertiary Admissions Rank) but the requirements are set by the course providers. For more details please visit: http://www.nursingmidwiferyboard.gov.au/ Study to become an enrolled nurse in Australia as an international student The minimum requirement for an enrolled nurse is a diploma. In order to achieve a diploma, international students need to commit to linguistic accuracy when using clinical terminology. They must also commit to achieving high levels of English in order to be accepted as a nurse and to function well in the nursing and nursing study environment. After completing a Diploma of Nursing, students may either stay as an enrolled nurse for their career or combine working as an enrolled nurse and pursue further study to apply for a Bachelor’s degree in Nursing. This will help progress their skills and knowledge to become future registered nurse. Challenges Enrolled nurses must be prepared to be supervised and report to registered nurses. Therefore respect for authority is important. Enrolled nurses should also have a clear and possible plan for the future careers and understand that they will need to regularly update their skills and knowledge in order to stay relevant and update to nursing trends, nursing environment expectations and to ensure they provision quality nursing care. Salary The most common annual salary in Australia for an enrolled nurse is between 55k AUD to 65k AUD.",
  "Interview training for nurses": "At Exceptional Study Australia we offer one on one interview training for nurses that have achieved an interview in a hospital, nursing agency or other healthcare organisation. Our one off session will last normally around 1.5 hours and can be conducted from the comfort of your home online. Using Skype, we can run a mock interview based on the job you have applied for to help you prepare from start to finish of your interview. As experienced recruiters we will take the role of an interviewer, recruiter or human resource manager, develop a set of interview questions and ask you to consider and respond to appropriate selection criteria or competencies. You will have asked a series of questions to demonstrate that your skills and abilities relate to standards or abilities your employer would be expected to ask you on the day of your actual interview. These questions may include behaviour-based questions and hypothetical questions. The purpose of the interview is to validate and build on the answers you have given in your written application. The questions we will ask in interviews will be based on the same criteria as the health care organization you are interviewing for. As nursing positions have very strict requirements for professional knowledge, we will ask you to demonstrate your knowledge, provide plenty of examples and test your confidence as a nurse. Our goal is to help you as a nurse to succeed in your nursing job interview and be able to answer any question in a calm, strong and confident manner. We will also cover: What hiring managers and recruiters are looking for from candidates Confidence and nerve control techniques How to make a great first impression Structuring confident answers Dealing with panel interviews The types of questions you may be asked Rapport building techniques Interview do’s and don’ts We will also send you a list of interview skills to help you prepare before your nursing interview big day! Overall we want our nurses to be successful in any interview.",
  "LinkedIn profiles for nurses": "At Exceptional Study Australia we can develop your professional LinkedIn profile as a nurse. As the world’s most comprehensive professional network, LinkedIn features more than 200 million members from around the globe comprising of jobseekers, recruiters and businesses in all different industries, including the healthcare industry. As a nurse creating a LinkedIn profile may be a strategic and positive career investment to distinguish you and set you apart from other graduate nurses and experienced nurses in Australia and internationally. To a professional candidate, a properly decorated and written LinkedIn profile can help you create your brand and effectively position yourself for a professional position in the nursing industry. LinkedIn allows you to promote yourself as a nurse online, actively connect with a wide range of professionals, put you in front hundred od healthcare recruiters, hiring managers, nursing agencies and Human Resource executives and allows you to stay in contact with current and former colleagues, employers and other contacts if they are also on LinkedIn. For a nurse, LinkedIn is a hidden gold mine for healthcare employment opportunities and networking. Exceptional Study Australia provides a professional team to complete LinkedIn profile writing services. Including but not limited to writing personal profiled, career goals, work experience and any awards in your life. Each professional writer of our team plays a different role. We provide a keyword-optimized profile service. Our goal is to develop a comprehensive profile for our jobseekers, achieve a higher ranking on the LinkedIn platform, differentiate our customers from our competitors, and increase our jobseekers’ overall visibility to recruiters and potential employers online.",

  "Graduate resumes": "Being a new university graduate or RTO college graduate is an exciting yet daunting experience for many students as it is the start of a new life and a new career. Every year thousands of Australian and international students complete a certificate, diploma, advanced diploma, bachelor’s degree, master’s degree or PHD at university, TAFE or an RTO college with the hope of achieving their ideal career or first job. However, the truth is, it is getting more and more competitive to achieve a full-time, part-time or graduate program position either in Australia or overseas. Recruiters require more than just a qualification. Therefore, at Exceptional Study Australia we specialise in writing employment applications for new university graduates. Our team of resume writers are professionals in writing professional resumes to capture students in a detailed, honest and well written manner in order to showcase their education background, their skills, their employment experience and every other important attribute they bring as a new graduate. We specialise in creating employment applications for any of the following groups of graduate students who are applying for an official graduate program, full-time, part-time, contractual or casual position after graduation.  Business graduates Marketing graduates Accounting graduates Commerce graduates Law graduates Building and construction graduates Engineering and architecture graduates Medicine graduates Dentistry graduates Pharmacy graduates Psychology graduates Social work graduates Counselling graduates",
  "Selection criteria and suitability statements for graduates": "As our resume writers have all completed both a university degree and VET sector qualification and hold experience in recruiting, we understand exactly what recruiters are seeking in a new graduate. At Exceptional Study Australia it is our goal as resume writers to effectively frame you as a student jobseeker to give you the greatest competitive advantage. For both Australian and international jobseekers who are applying for any advertised and non-advertised graduate jobs, graduate programs or entry-level roles, we offer the following professional job application services:  Resumes Cover letters Answers to selection criteria Answers to government suitability statements LinkedIn profiles,",
  "LinkedIn profiles for graduates": "At Exceptional Study Australia we can develop your professional LinkedIn profile as graduate students. As the world’s most comprehensive professional network, LinkedIn features more than 200 million members from around the globe comprising of jobseekers, recruiters and businesses in all different industries. To a professional candidate, a properly decorated and written LinkedIn profile can help you create your brand and effectively position yourself for a professional position. Exceptional Study Australia provides a professional team to complete LinkedIn profile writing services. Including but not limited to writing personal profiled, career goals, work experience and any awards in your life. Each professional writer of our team plays a different role. We provide a keyword-optimized profile service. Our goal is to develop a comprehensive profile for our jobseekers, achieve a higher ranking on the LinkedIn platform, differentiate our customers from our competitors, and increase our jobseekers’ overall visibility to recruiters and potential employers online.",
  "Interview training for graduates": "At Exceptional Study Australia we offer one on one interview training for graduate students that have achieved an interview in any business with any position. Our one off session will last normally around 1.5 hours and can be conducted from the comfort of your home online. Using Skype, we can run a mock interview based on the job you have applied for to help you prepare from start to finish of your interview. As experienced recruiters we will take the role of an interviewer, recruiter or human resource manager, develop a set of interview questions and ask you to consider and respond to appropriate selection criteria or competencies. You will have asked a series of questions to demonstrate that your skills and abilities relate to standards or abilities your employer would be expected to ask you on the day of your actual interview. These questions may include behaviour-based questions and hypothetical questions. The purpose of the interview is to validate and build on the answers you have given in your written application. The questions we will ask in interviews will be based on the same criteria as the health care organization you are interviewing for. As graduate students, it may have very strict requirements for some basic knowledge. Therefore we will ask you to demonstrate your knowledge, provide plenty of examples and test your confidence which we believe may be suitable for the position you are interviewing for. Our goal is to help you to succeed in your job interview and be able to answer any question in a calm, strong and confident manner.  We will also cover:  What hiring managers and recruiters are looking for from candidates Confidence and nerve control techniques How to make a great first impression? Structuring confident answers Dealing with panel interviews The types of questions you may be asked Rapport building techniques Interview do’s and don’ts We will also send you a list of interview skills to help you prepare before your interview big day! Overall we want our graduates to be successful in any interview."
}
